
/* 函数名 ：
 * 功能：用素因子分解算法计算复序列的离散傅里叶变换。序列长度是数集{2,3,4,5,7,8,9，16}
 *       中的一个或几个互素银子的乘积。
 * 输入参数：
 * 输出参数：
 * 说明：
 * 备注：
 */

#include <math.h>

void pft(double x[],  // 长度为n，开始存放变换数据实部，最后存放变换结果实部
	double y[], // 长度为n，开始存放变换数据虚部，最后存放变换结果虚部
	int n,  // 数据长度n必须能分解为m个两两互素整数相乘，即n=ni(0)*ni(1)*...*ni(m-1)
	int m,  // 素因子的个数
	int ni[])  // 数据长度为m。用于存放m个两两互素的素因子。
{
	int j,k,r,it,n1,n2,unsc,i[17];
	double c31,c32,c51,c52,c53,c54,c55;
	double c71,c72,c73,c74,c75,c76,c77,c78,c81;
	double c92,c93,c94,c95,c96,c97,c98;
	double c162,c163,c164,c165;
	double r1,r2,r3,r4,r5,r6,r7,r8,r9,r10,r11,r12,r13,r14,r15,r16;
	double s1,s2,s3,s4,s5,s6,s7,s8,s9,s10,s11,s12,s13,s14,s15,s16;
	double t,t0,t1,t2,t3,t4,t5,t6,t7,t8,t9;
	double * a, * b;

	c31 = -0.86602540; c32 = -1.5;
	c51 =  0.95105652; c52 = -1.53884180;
	c53 = -0.36327126; c54 =  0.55901699;
	c55 = -1.25;
	c71 = -1.16666667; c72 = -0.79015647;
	c73 =  0.055854267;c74 =  0.7343022;
	c75 =  0.44095855; c76 = -0.34087293;
	c77 =  0.53396936; c78 =  0.87484229;
	c81 =  0.70710678;
	c92 =  0.93969262; c93 = -0.17364818;
	c94 =  0.76604444; c95 = -0.5;
	c96 = -0.34202014; c97 = -0.98480775;
	c98 = -0.64278761;
	c162=  0.38268343; c163=  1.30656297;
	c164=  0.54119610; c165=  0.92387953;

	for(k=0; k<m; k++)
	{
		n1 = ni[k];
		n2 = n / n1;
		for(j=0; j<n; j+=n1)
		{
			it = j;
			i[1] = j;
			for(r=2; r<=n1; r++)
			{
				it = it + n2;
				if(it > (n-1)) it = it - n;
				i[r] = it;
			}

			switch(n1)
			{
			case 2:
				{
					r1 = x[i[1]];
					x[i[1]] = r1 + x[i[2]];
					x[i[2]] = r1 - x[i[2]];
					r1 = y[i[1]];
					y[i[1]] = r1 + y[i[2]];
					y[i[2]] = r1 - y[i[2]];
					break;
				}
			case 3:
				{
					r1 = x[i[2]] + x[i[3]];
					r2 = (x[i[2]] - x[i[3]]) * c31;
					x[i[1]] = x[i[1]] + r1;
					r1 = x[i[1]] + r1 * c32;
					s1 = y[i[2]] + y[i[3]];
					s2 = (y[i[2]] - y[i[3]]) * c31;
					y[i[1]] = y[i[1]] + s1;
					s1 = y[i[1]] + s1 * c32;
					x[i[2]] = r1 - s2;
					x[i[3]] = r1 + s2;
					y[i[2]] = s1 + r2;
					y[i[3]] = s1 - r2;
					break;
				}
			case 4:
				{
					r1 = x[i[1]] + x[i[3]];
					t1 = x[i[1]] - x[i[3]];
					r2 = x[i[2]] + x[i[4]];
					x[i[1]] = r1 + r2;
					x[i[3]] = r1 - r2;
					r1 = y[i[1]] + y[i[3]];
					t2 = y[i[1]] - y[i[3]];
					r2 = y[i[2]] + y[i[4]];
					y[i[1]] = r1 + r2;
					y[i[3]] = r1 - r2;
					r1 = x[i[2]] - x[i[4]];
					r2 = y[i[2]] - y[i[4]];
					x[i[2]] = t1 + r2;
					x[i[4]] = t1 - r2;
					y[i[2]] = t2 - r1;
					y[i[4]] = t2 + r1;
					break;
				}
			case 5:
				{
					r1 = x[i[2]] + x[i[5]];
					r4 = x[i[2]] - x[i[5]];
					r3 = x[i[3]] + x[i[4]];
					r2 = x[i[3]] - x[i[4]];
					t = (r1 - r3) * c54;
					r1 = r1 + r3;
					x[i[1]] = x[i[1]] + r1;
					r1 = x[i[1]] + r1 * c55;
					r3 = r1 - t;
					r1 = r1 + t;
					t = (r4 + r2) * c51;
					r4 = t + r4 * c52;
					r2 = t + r2 * c53;

					s1 = y[i[2]] + y[i[5]];
					s4 = y[i[2]] - y[i[5]];
					s3 = y[i[3]] + y[i[4]];
					s2 = y[i[3]] - y[i[4]];
					t = (s1 - s3) * c54;
					s1 = s1 + s3;
					y[i[1]] = y[i[1]] + s1;
					s1 = y[i[1]] + s1 * c55;
					s3 = s1 - t;
					s1 = s1 + t;
					t = (s4 + s2) * c51;
					s4 = t + s4 * c52;
					s2 = t + s2 * c53;

					x[i[2]] = r1 + s2;
					x[i[5]] = r1 - s2;
					x[i[3]] = r3 - s4;
					x[i[4]] = r3 + s4;
					y[i[2]] = s1 - r2;
					y[i[5]] = s1 + r2;
					y[i[3]] = s3 + r4;
					y[i[4]] = s3 - r4;
					break;
				}
			case 7:
				{
					r1 = x[i[2]] + x[i[7]];
					r6 = x[i[2]] - x[i[7]];
					s1 = y[i[2]] + y[i[7]];
					s6 = y[i[2]] - y[i[7]];
					r2 = x[i[3]] + x[i[6]];
					r5 = x[i[3]] - x[i[6]];
					s2 = y[i[3]] + y[i[6]];
					s5 = y[i[3]] - y[i[6]];
					r3 = x[i[4]] + x[i[5]];
					r4 = x[i[4]] - x[i[5]];
					s3 = y[i[4]] + y[i[6]];
					s4 = y[i[4]] - y[i[5]];

					t3 = (r1 - r2) * c74;
					t = (r1 - r3) * c72;
					r1 = r1 + r2 + r3;
					x[i[1]] = x[i[1]] + r1;
					r1 = x[i[1]] + r1 * c71;
					r2 = (r3 - r2) * c73;
					r3 = r1 - t + r2;
					r2 = r1 - r2 - t3;
					r1 = r1 + t + t3;
					t = (r6 - r5) * c78;
					t3 = (r6 + r4) * c76;
					r6 = (r6 + r5 - r4) * c75;
					r5 = (r5 + r4) * c77;
					r4 = r6 - t3 + r5;
					r5 = r6 - r5 - t;
					r6 = r6 + t3 + t;

					t3 = (s1 - s2) * 74;
					t = (s1 - s3) * c72;
					s1 = s1 + s2 + s3;
					y[i[1]] = y[i[1]] + s1;
					s1 = y[i[1]] + s1 * c71;
					s2 = (s3 - s2) * c73;
					s3 = s1 - t + s2;
					s2 = s1 - s2 - t3;
					s1 = s1 + t + t3;
					t = (s6 - s5) * c78;
					t3 = (s6 + s4) * c76;
					s6 = (s6 + s5 - s4) *c75;
					s5 = (s5 + s4) * c77;
					s4 = s6 - t3 + s5;
					s5 = s6 - s5 - t;
					s6 = s6 + t3 + t;

					x[i[2]] = r3 + s4;
					x[i[7]] = r3 - s4;
					x[i[3]] = r1 + s6;
					x[i[6]] = r1 - s6;
					x[i[4]] = r2 - s5;
					x[i[5]] = r2 + s5;
					y[i[2]] = s3 - r4;
					y[i[7]] = s3 + r4;
					y[i[3]] = s1 - r6;
					y[i[6]] = s1 + r6;
					y[i[4]] = s2 + r5;
					y[i[5]] = s2 - r5;
					break;
				}
			case 8:
				{
					r1 = x[i[1]] + x[i[5]];
					r2 = x[i[1]] - x[i[5]];
					r3 = x[i[2]] + x[i[8]];
					r4 = x[i[2]] - x[i[8]];
					r5 = x[i[3]] + x[i[7]];
					r6 = x[i[3]] - x[i[7]];
					r7 = x[i[4]] + x[i[6]];
					r8 = x[i[4]] - x[i[6]];
					t1 = r1 + r5;
					t2 = r1 - r5;
					t3 = r3 + r7;
					r3 = (r3 - r7) * c81;
					x[i[1]] = t1 + t3;
					x[i[5]] = t1 - t3;
					t1 = r2 + r3;
					t3 = r2 - r3;
					s1 = r4 - r8;;
					r4 = (r4 + r8) * c81;
					s2 = r4 + r6;
					s3 = r4 - r6;

					r1 = y[i[1]] + y[i[5]];
					r2 = y[i[1]] - y[i[5]];
					r3 = y[i[2]] + y[i[8]];
					r4 = y[i[2]] - y[i[8]];
					r5 = y[i[3]] + y[i[7]];
					r6 = y[i[3]] - y[i[7]];
					r7 = y[i[4]] + y[i[6]];
					r8 = y[i[4]] - y[i[6]];
					t4 = r1 + r5;
					r1 = r1 - r5;
					r5 = r3 + r7;
					r3 = (r3 - r7) * c81;
					y[i[1]] = t4 + r5;
					y[i[5]] = t4 - r5;
					r5 = r2 + r3;
					r2 = r2 - r3;
					r3 = r4 - r8;
					r4 = (r4 + r8) * c81;
					r7 = r4 + r6;
					r4 = r4 - r6;

					x[i[2]] = t1 + r7;
					x[i[8]] = t1 - r7;
					x[i[3]] = t2 + r3;
					x[i[7]] = t2 - r3;
					x[i[4]] = t3 + r4;
					x[i[6]] = t3 - r4;
					y[i[2]] = r5 - s2;
					y[i[8]] = r5 + s2;
					y[i[3]] = r1 - s1;
					y[i[7]] = r1 + s1;
					y[i[4]] = r2 - s3;
					y[i[6]] = r2 + s3;
					break;
				}
			case 9:
				{
					r1 = x[i[2]] + x[i[9]];
					r2 = x[i[2]] - x[i[9]];
					r3 = x[i[3]] + x[i[8]];
					r4 = x[i[3]] - x[i[8]];
					r5 = x[i[4]] + x[i[7]];
					t8 = (x[i[4]] - x[i[7]]) * c31;
					r7 = x[i[5]] + x[i[6]];
					r8 = x[i[5]] - x[i[6]];
					t0 = x[i[1]] + r5;
					t7 = x[i[1]] + r5 * c95;
					r5 = r1 + r3 + r7;
					x[i[1]] = t0 + r5;
					t5 = t0 + r5 * c95;
					t3 = (r3 - r7) * c92;
					r7 = (r1 - r7) * c93;
					r3 = (r1 - r3) * c94;
					t1 = t7 + t3 + r3;
					t3 = t7 - t3 - r7;
					t7 = t7 + r7 - r3;
					t6 = (r2 - r4 + r8) *c31;
					t4 = (r4 + r8) * c96;
					r8 = (r2 - r8) * c97;
					r2 = (r2 + r4) * c98;
					t2 = t8 + t4 + r2;
					t4 = t8 - t4 - r8;
					t8 = t8 + r8 - r2;

					r1 = y[i[2]] + y[i[9]];
					r2 = y[i[2]] - y[i[9]];
					r3 = y[i[3]] + y[i[8]];
					r4 = y[i[3]] - y[i[8]];
					r5 = y[i[4]] + y[i[7]];
					r6 = (y[i[4]] - y[i[7]]) * c31;
					r7 = y[i[5]] + y[i[6]];
					r8 = y[i[5]] - y[i[6]];
					t0 = y[i[1]] + r5;
					t9 = y[i[1]] + r5 * c95;
					r5 = r1 + r3 + r7;
					y[i[1]] = t0 + r5;
					r5 = t0 + r5 * c95;
					t0 = (r3 - r7) * c92;
					r7 = (r1 - r7) * c93;
					r3 = (r1 - r3) * c94;
					r1 = t9 + t0 + r3;
					t0 = t9 - t0 - r7;
					r7 = t9 + r7 - r3;
					r9 = (r2 - r4 + r8) * c31;
					r3 = (r4 + r8) * c96;
					r8 = (r2 - r8) * c97;
					r4 = (r2 + r4) * c98;
					r2 = r6 + r3 + r4;
					r3 = r6 - r8 - r3;
					r8 = r6 + r8 - r4;

					x[i[2]] = t1 - r2;
					x[i[9]] = t1 + r2;
					x[i[3]] = t3 + r3;
					x[i[8]] = t3 - r3;
					x[i[4]] = t5 - r9;
					x[i[7]] = t5 + r9;
					x[i[5]] = t7 - r8;
					x[i[6]] = t7 + r8;
					y[i[2]] = r1 + t2;
					y[i[9]] = r1 - t2;
					y[i[3]] = t0 - t4;
					y[i[8]] = t0 + t4;
					y[i[4]] = r5 + t6;
					y[i[7]] = r5 - t6;
					y[i[5]] = r7 + t8;
					y[i[6]] = r7 - t8;
					break;
				}
			case 16:
				{
					r1 = x[i[1]] + x[i[9]];
					r2 = x[i[1]] - x[i[9]];
					r3 = x[i[2]] + x[i[10]];
					r4 = x[i[2]] - x[i[10]];
					r5 = x[i[3]] + x[i[11]];
					r6 = x[i[3]] - x[i[11]];
					r7 = x[i[4]] + x[i[12]];
					r8 = x[i[4]] - x[i[12]];
					r9 = x[i[5]] + x[i[13]];
					r10 = x[i[5]] - x[i[13]];
					r11 = x[i[6]] + x[i[14]];
					r12 = x[i[6]] - x[i[14]];
					r13 = x[i[7]] + x[i[15]];
					r14 = x[i[7]] - x[i[15]];
					r15 = x[i[8]] + x[i[16]];
					r16 = x[i[8]] - x[i[16]];

					t1 = r1 + r9;
					t2 = r1 - r9;
					t3 = r3 + r11;
					t4 = r3 - r11;
					t5 = r5 + r13;
					t6 = r5 - r13;
					t7 = r7 + r15;
					t8 = r7 - r15;
					r1 = t1 + t5;
					r3 = t1 - t5;
					r5 = t3 + t7;
					r7 = t3 - t7;
					x[i[1]] = r1 + r5;
					x[i[9]] = r1 - r5;
					t1 = (t4 + t8) * c81;
					t5 = (t4 - t8) * c81;
					r9 = t2 + t5;
					r11 = t2 - t5;
					r13 = t6 + t1;
					r15 = t6 - t1;
					t1 = r4 + r16;
					t2 = r4 - r16;
					t3 = (r6 + r14) * c81;
					t4 = (r6 - r14) * c81;
					t5 = r8 + r12;
					t6 = r8 - r12;
					t7 = (t2 - t6) * c162;
					t2 = c163 * t2 - t7;
					t6 = c164 * t6 - t7;
					t7 = r2 + t4;
					t8 = r2 - t4;
					r2 = t7 + t2;
					r4 = t7 - t2;
					r6 = t8 + t6;
					r8 = t8 - t6;
					t7 = (t1 + t5) * c165;
					t2 = t7 - t1 * c164;
					t4 = t7 - t5 * c163;
					t6 = r10 + r3;
					t8 = r10 - t3;
					r10 = t6 + t2;
					r12 = t6 - t2;
					r14 = t8 + t4;
					r16 = t8 - t4;

					r1 = y[i[1]] + y[i[9]];
					s2 = y[i[1]] - y[i[9]];
					s3 = y[i[2]] + y[i[10]];
					s4 = y[i[2]] - y[i[10]];
					r5 = y[i[3]] + y[i[11]];
					s6 = y[i[3]] - y[i[11]];
					s7 = y[i[4]] + y[i[12]];
					s8 = y[i[4]] - y[i[12]];
					s9 = y[i[5]] + y[i[13]];
					s10 = y[i[5]] - y[i[13]];
					s11 = y[i[6]] + y[i[14]];
					s12 = y[i[6]] - y[i[14]];
					s13 = y[i[7]] + y[i[15]];
					s14 = y[i[7]] - y[i[15]];
					s15 = y[i[8]] + y[i[16]];
					s16 = y[i[8]] - y[i[16]];
					t1 = r1 + s9;
					t2 = r1 - s9;
					t3 = s3 + s11;
					t4 = s3 - s11;
					t5 = r5 + s13;
					t6 = r5 - s13;
					t7 = s7 + s15;
					t8 = s7 - s15;
					r1 = t1 + t5;
					s3 = t1 - t5;
					r5 = t3 + t7;
					s7 = t3 - t7;
					y[i[1]] = r1 + r5;
					y[i[9]] = r1 - r5;
					x[i[5]] = r3 + s7;
					x[i[13]] = r3 - s7;
					y[i[5]] = s3 - r7;
					y[i[13]] = s3 + r7;
					t1 = (t4 + t8) * c81;
					t5 = (t4 - t8) * c81;
					s9 = t2 + t5;
					s11 = t2 - t5;
					s13 = t6 + t1;
					s15 = t6 - t1;
					t1 = s4 + s16;
					t2 = s4 - s16;
					t3 = (s6 + s14) * c81;
					t4 = (s6 - s14) * c81;
					t5 = s8 + s12;
					t6 = s8 - s12;
					t7 = (t2 - t6) * c162;
					t2 = c163 * t2 - t7;
					t6 = c164 * t6 - t7;
					t7 = s2 + t4;
					t8 = s2 - t4;
					s2 = t7 + t2;
					s4 = t7 - t2;
					s6 = t8 + t6;
					s8 = t8 - t6;
					t7 = (t1 + t5) * c165;
					t2 = t7 - t1 * c164;
					t4 = t7 - t5 * c163;
					t6 = s10 + t3;
					t8 = s10 - t3;
					s10 = t6 + t2;
					s12 = t6 - t2;
					s14 = t8 + t4;
					s16 = t8 - t4;

					x[i[ 2]] = r2 + s10;
					x[i[16]] = r2 - s10;
					x[i[ 3]] = r9 + s13;
					x[i[15]] = r9 - s13;
					x[i[ 4]] = r8 - s16;
					x[i[14]] = r8 + s16;
					x[i[ 6]] = r6 + s14;
					x[i[12]] = r6 - s14;
					x[i[ 7]] = r11 - s15;
					x[i[11]] = r11 + s15;
					x[i[ 8]] = r4 - s12;
					x[i[10]] = r4 + s12;
					y[i[ 2]] = s2 - r10;
					y[i[16]] = s2 + r10;
					y[i[ 3]] = s9 - r13;
					y[i[15]] = s9 + r13;
					y[i[ 4]] = s8 + r16;
					y[i[14]] = s8 - r16;
					y[i[ 6]] = s6 - r14;
					y[i[12]] = s6 + r14;
					y[i[ 7]] = s11 + r15;
					y[i[11]] = s11 - r15;
					y[i[ 8]] = s4 + r12;
					y[i[10]] = s4 - r12;
					break;
				}
			}
		}
	}
	a = new double[n * sizeof(double)];
	b = new double[n * sizeof(double)];
	unsc = 0;
	for(k=0; k<m; k++)
		unsc = unsc + n / ni[k];
	unsc = unsc % n;
	r = 0;
	for(k=0; k<n; k++)
	{
		a[k] = x[r];
		b[k] = y[r];
		r = r + unsc;
		if(r > (n-1)) r = r - n;
	}

	for(k=0; k<n; k++)
	{
		x[k] = a[k];
		y[k] = b[k];
	}

	delete a,b;

}
